Repository: arkaraung829/LifeAndGym
Catalog: lib/l10n/app_*.arb
Languages: my

source: Welcome back
my: ပြန်လည်ကြိုဆိုပါတယ်

# signInToContinue
source: Sign in to continue your fitness journey
my: သင့်ကျန်းမာရေးခရီးကို ဆက်လက်လုပ်ဆောင်ရန် ဝင်ရောက်ပါ

source: Email
my: အီးမေးလ်

source: Enter your email
my: သင့်အီးမေးလ်ကို ထည့်သွင်းပါ

source: Password
my: စကားဝှက်

source: Enter your password
my: သင့်စကားဝှက်ကို ထည့်သွင်းပါ

source: Forgot password?
my: စကားဝှက်မေ့သွားပါသလား?

source: Sign In
my: ဝင်ရောက်ရန်

source: Sign Up
my: အကောင့်ဖွင့်ရန်

source: or
my: သို့မဟုတ်

source: Continue with Google
my: Google ဖြင့်ဆက်လက်လုပ်ဆောင်ပါ

source: Continue with Apple
my: Apple ဖြင့်ဆက်လက်လုပ်ဆောင်ပါ

# dontHaveAccount
source: Don't have an account?
my: အကောင့်မရှိသေးဘူးလား?

# alreadyHaveAccount
source: Already have an account?
my: အကောင့်ရှိပြီးသားလား?

source: Login failed
my: ဝင်ရောက်မှုမအောင်မြင်ပါ

# redirectingToGoogle
source: Redirecting to Google sign in...
my: Google သို့ ပြောင်းလဲနေသည်...

source: Google sign in failed
my: Google ဝင်ရောက်မှု မအောင်မြင်ပါ

source: Apple sign in coming soon
my: Apple ဝင်ရောက်မှု မကြာမီလာပါမည်

source: Good morning
my: မင်္ဂလာနံနက်ခင်းပါ

source: Good afternoon
my: မင်္ဂလာနေ့လည်ခင်းပါ

source: Good evening
my: မင်္ဂလာညနေခင်းပါ

source: Guest
my: ဧည့်သည်

source: Member
my: အသင်းဝင်

source: CHECKED IN
my: ဝင်ရောက်ပြီး

source: TAP TO CHECK IN
my: ဝင်ရောက်ရန် နှိပ်ပါ

source: Scan to Check In
my: ဝင်ရောက်ရန် စကင်ဖတ်ပါ

source: Close
my: ပိတ်ရန်

source: No active membership
my: အသင်းဝင်မှုမရှိပါ

# memberType
source: {type} Member
my: {type} အသင်းဝင်

source: No gym available
my: ဂျင်မရှိပါ

source: Not Busy
my: လူနည်း

source: Moderate
my: အသင့်အတင့်

source: Busy
my: လူများ

# occupancyStatus
source: {status} â€¢ {current}/{capacity} people
my: {status} • {current}/{capacity} ဦး

source: Workout in Progress
my: လေ့ကျင့်နေဆဲ

source: Today's Workout
my: ယနေ့လေ့ကျင့်မှု

source: Continue your session
my: သင့်လေ့ကျင့်မှုကို ဆက်လက်လုပ်ဆောင်ပါ

# startQuickWorkout
source: Start a Quick Workout
my: အမြန်လေ့ကျင့်မှု စတင်ပါ

source: Tap to resume
my: ဆက်လက်လုပ်ဆောင်ရန် နှိပ်ပါ

source: No planned workouts
my: စီစဉ်ထားသော လေ့ကျင့်မှုမရှိပါ

source: Resume Workout
my: လေ့ကျင့်မှု ဆက်လုပ်ရန်

source: Start Workout
my: လေ့ကျင့်မှု စတင်ရန်

# estimatedMinutes
source: ~{minutes} min
my: ~{minutes} မိနစ်

source: Upcoming Classes
my: လာမည့်အတန်းများ

source: See All
my: အားလုံးကြည့်ရန်

source: No classes scheduled today
my: ယနေ့အတန်းမရှိပါ

source: BOOKED
my: မှာထားပြီး

# spotsRemaining
source: {count} spots
my: နေရာ {count} ခု

source: This Week
my: ဤအပတ်

# dayStreak
source: {count} Day Streak!
my: {count} ရက် အစဉ်ဆက်!

# workoutsCompleted
source: {completed}/{total} workouts completed
my: {completed}/{total} လေ့ကျင့်မှု ပြီးစီးပြီ

source: Home
my: ပင်မ

source: Workouts
my: လေ့ကျင့်မှုများ

source: Classes
my: အတန်းများ

source: Progress
my: တိုးတက်မှု

source: Profile
my: ကိုယ်ရေးအချက်အလက်

source: Create account
my: အကောင့်ဖန်တီးရန်

# startYourFitnessJourney
source: Start your fitness journey today
my: သင့်ကျန်းမာရေးခရီးကို ယနေ့စတင်ပါ

source: Full Name
my: အမည်အပြည့်အစုံ

source: Enter your full name
my: သင့်အမည်အပြည့်အစုံကို ထည့်သွင်းပါ

source: Confirm Password
my: စကားဝှက် အတည်ပြုပါ

source: Re-enter your password
my: သင့်စကားဝှက်ကို ပြန်ထည့်ပါ

# bySigningUp
source: By signing up, you agree to our
my: အကောင့်ဖွင့်ခြင်းဖြင့်

source: Terms of Service
my: ဝန်ဆောင်မှုစည်းမျဉ်းများ

source: and
my: နှင့်

source: Privacy Policy
my: ကိုယ်ရေးအချက်အလက်မူဝါဒ

source: Registration failed
my: အကောင့်ဖွင့်မှု မအောင်မြင်ပါ

source: Reset Password
my: စကားဝှက် ပြန်လည်သတ်မှတ်ရန်

# enterEmailForReset
source: Enter your email address and we'll send you instructions to reset your password.
my: သင့်အီးမေးလ်လိပ်စာကို ထည့်သွင်းပါ။ စကားဝှက်ပြန်လည်သတ်မှတ်ရန် လမ်းညွှန်ချက်များ ပေးပို့ပါမည်။

source: Send Reset Link
my: ပြန်လည်သတ်မှတ်ရန် လင့်ခ် ပေးပို့ပါ

source: Back to Login
my: ဝင်ရောက်မှုသို့ ပြန်သွားရန်

# resetEmailSent
source: Password reset email sent. Please check your inbox.
my: စကားဝှက်ပြန်လည်သတ်မှတ်ရန် အီးမေးလ် ပေးပို့ပြီးပါပြီ။ သင့် inbox ကို စစ်ဆေးပါ။

source: Exercises
my: လေ့ကျင့်ခန်းများ

source: Exercise Library
my: လေ့ကျင့်ခန်း စာကြည့်တိုက်

source: Search exercises...
my: လေ့ကျင့်ခန်းများ ရှာဖွေရန်...

source: All Exercises
my: လေ့ကျင့်ခန်းအားလုံး

source: My Workouts
my: ကျွန်ုပ်၏

source: Templates
my: နမူနာ

source: History
my: မှတ်တမ်း

source: Workout History
my: လေ့ကျင့်မှု မှတ်တမ်း

source: No workouts yet
my: လေ့ကျင့်မှု မရှိသေးပါ

# startYourFirstWorkout
source: Start your first workout to see your history here.
my: သင့်ပထမဆုံးလေ့ကျင့်မှုကို စတင်ပါ၊ မှတ်တမ်းကို ဤနေရာတွင် မြင်တွေ့ရပါမည်။

source: Active Workout
my: လက်ရှိလေ့ကျင့်မှု

source: Duration
my: ကြာချိန်

source: sets
my: အစိတ်

source: Reps
my: ပြန်လုပ်

source: Weight
my: အလေးချိန်

source: Add Exercise
my: လေ့ကျင့်ခန်း ထည့်ရန်

source: Finish Workout
my: လေ့ကျင့်မှု အဆုံးသတ်ရန်

source: Cancel Workout
my: လေ့ကျင့်မှု ပယ်ဖျက်ရန်

source: Schedules
my: အချိန်ဇယားများ

source: My Bookings
my: ကျွန်ုပ်၏ ကြိုတင်မှာယူမှုများ

source: Book Class
my: အတန်း ကြိုတင်မှာယူရန်

source: Cancel Booking
my: ကြိုတင်မှာယူမှု ပယ်ဖျက်ရန်

source: Class Details
my: အတန်း အသေးစိတ်

source: Instructor
my: နည်းပြ

source: Level
my: အဆင့်

source: Statistics
my: စာရင်းအင်း

source: Total Workouts
my: စုစုပေါင်း လေ့ကျင့်မှု

source: Total Minutes
my: စုစုပေါင်း မိနစ်

source: Total Weight
my: စုစုပေါင်း အလေးချိန်

source: Current Streak
my: လက်ရှိ ဆက်တိုက်

source: Edit Profile
my: ကိုယ်ရေးအချက်အလက် တည်းဖြတ်ရန်

source: Save
my: သိမ်းဆည်းရန်

source: Cancel
my: ပယ်ဖျက်ရန်

source: Settings
my: ဆက်တင်များ

source: Notifications
my: အသိပေးချက်များ

source: Dark Mode
my: အမှောင်မုဒ်

source: Language
my: ဘာသာစကား

source: About
my: အကြောင်း

source: Version
my: ဗားရှင်း

source: Logout
my: ထွက်ရန်

# logoutConfirmation
source: Are you sure you want to logout?
my: ထွက်လိုသည်မှာ သေချာပါသလား?

source: Yes
my: ဟုတ်ကဲ့

source: No
my: မဟုတ်ပါ

source: Error
my: အမှား

source: Try Again
my: ထပ်ကြိုးစားပါ

source: Loading...
my: ဖွင့်နေသည်...

source: No internet connection
my: အင်တာနက်ချိတ်ဆက်မှု မရှိပါ

source: Something went wrong
my: တစ်ခုခုမှားသွားပါသည်

source: Guest Mode
my: ဧည့်သည်မုဒ်

# guestModeMessage
source: Sign in to access all features
my: အင်္ဂါရပ်များအားလုံးကို ဝင်ရောက်ရန် ဝင်ရောက်ပါ

source: Sign In Now
my: ယခု ဝင်ရောက်ပါ

source: Get Started
my: စတင်ရန်

source: Skip
my: ကျော်ရန်

source: Next
my: ရှေ့သို့

source: Done
my: ပြီးပါပြီ

# welcomeToLifeAndGym
source: Welcome to Life & Gym
my: Life & Gym မှ ကြိုဆိုပါတယ်

# fitnessJourneyStarts
source: Your fitness journey starts here
my: သင့်ကျန်းမာရေးခရီး ဤနေရာမှ စတင်သည်

source: Explore as Guest
my: ဧည့်သည်အဖြစ် လေ့လာရန်

source: kg
my: ကီလို

source: lbs
my: ပေါင်

source: min
my: မိနစ်

source: sec
my: စက္ကန့်

# validationEmailRequired
source: Email is required
my: အီးမေးလ် လိုအပ်ပါသည်

# validationEmailInvalid
source: Please enter a valid email
my: မှန်ကန်သော အီးမေးလ် ထည့်သွင်းပါ

# validationPasswordRequired
source: Password is required
my: စကားဝှက် လိုအပ်ပါသည်

# validationPasswordTooShort
source: Password must be at least 6 characters
my: စကားဝှက်သည် အနည်းဆုံး စာလုံး ၆ လုံး ရှိရမည်

# validationPasswordsDoNotMatch
source: Passwords do not match
my: စကားဝှက်များ မတူညီပါ

# validationNameRequired
source: Name is required
my: အမည် လိုအပ်ပါသည်

# validationFieldRequired
source: {field} is required
my: {field} လိုအပ်ပါသည်

# goals_title
source: Goals
my: ရည်မှန်းချက်များ

# goals_empty
source: No goals yet - Set your first goal!
my: ရည်မှန်းချက်မရှိသေးပါ - သင့်ပထမဆုံး ရည်မှန်းချက်ကို သတ်မှတ်ပါ!

source: Create Goal
my: ရည်မှန်းချက် ဖန်တီးရန်

source: Goal Name
my: ရည်မှန်းချက် အမည်

# goal_description
source: Description
my: ဖော်ပြချက်

source: Goal Type
my: ရည်မှန်းချက် အမျိုးအစား

source: Target Value
my: ပန်းတိုင်တန်ဖိုး

source: Current Value
my: လက်ရှိတန်ဖိုး

source: Target Date
my: ပန်းတိုင်ရက်စွဲ

source: days remaining
my: ကျန်ရှိနေသော ရက်

source: Overdue
my: သတ်မှတ်ရက်လွန်

source: Update Progress
my: တိုးတက်မှု အပ်ဒိတ်လုပ်ရန်

# mark_complete
source: Mark as Complete
my: ပြီးစီးကြောင်း အမှတ်အသားပြုရန်

source: Weight Loss
my: ကိုယ်အလေးချိန် လျှော့ချခြင်း

source: Muscle Gain
my: ကြွက်သား တိုးခြင်း

source: Strength
my: ခွန်အား

source: Endurance
my: ခံနိုင်ရည်

source: Flexibility
my: ပျော့ပြောင်းမှု

source: Body Fat
my: ကိုယ်တွင်းအဆီ

source: Consistency
my: တည်ငြိမ်မှု

# filter_all
source: All
my: အားလုံး

# filter_active
source: Active
my: လက်ရှိလုပ်ဆောင်နေဆဲ

# filter_completed
source: Completed
my: ပြီးစီးပြီး

source: Body Metrics
my: ခန္ဓာကိုယ် တိုင်းတာမှုများ

# body_metrics_empty
source: No metrics yet - Track your first measurement!
my: တိုင်းတာမှုမရှိသေးပါ - သင့်ပထမဆုံး တိုင်းတာမှုကို မှတ်တမ်းတင်ပါ!

source: Add Entry
my: မှတ်တမ်း ထည့်ရန်

source: Latest Metrics
my: နောက်ဆုံး တိုင်းတာမှုများ

source: Muscle Mass
my: ကြွက်သား ပမာណ

source: Measurements
my: တိုင်းတာမှုများ

source: Chest
my: ရင်ဘတ်

source: Waist
my: ခါး

source: Hips
my: တင်ပါး

source: Arms
my: လက်မောင်း

source: Thighs
my: ပေါင်

source: Trends
my: လမ်းကြောင်းများ

source: Overview
my: ခြုံငုံသုံးသပ်ချက်

source: Total Entries
my: စုစုပေါင်း မှတ်တမ်းများ

source: Days Tracked
my: မှတ်တမ်းတင်ထားသော ရက်

source: Recorded At
my: မှတ်တမ်းတင်ထားသည့် အချိန်

# bmi_underweight
source: Underweight
my: ကိုယ်အလေးချိန်နည်း

# bmi_normal
source: Normal
my: ပုံမှန်

# bmi_overweight
source: Overweight
my: ကိုယ်အလေးချိန်လွန်

# bmi_obese
source: Obese
my: အဝလွန်

source: Find Gyms
my: ဂျင်များ ရှာဖွေရန်

source: Search gyms...
my: ဂျင်များ ရှာဖွေရန်...

source: No gyms found
my: ဂျင်မတွေ့ပါ

source: Open Now
my: ယခု ဖွင့်နေသည်

source: Closed
my: ပိတ်သည်

source: capacity
my: ဆံ့နိုင်မှု

source: Amenities
my: အဆင်ပြေစေသော အရာများ

source: Operating Hours
my: ဖွင့်ချိန်များ

source: Open in Maps
my: မြေပုံတွင် ဖွင့်ရန်

source: Apply Filters
my: စစ်ထုတ်မှုများ အသုံးပြုရန်

source: Clear Filters
my: စစ်ထုတ်မှုများ ရှင်းလင်းရန်

source: Create Workout
my: လေ့ကျင့်မှု ဖန်တီးရန်

source: Basic Info
my: အခြေခံ အချက်အလက်

source: Exercise Selection
my: လေ့ကျင့်ခန်း ရွေးချယ်မှု

# exercise_configuration
source: Configuration
my: စီမံဖွဲ့စည်းမှု

# review
source: Review & Save
my: ပြန်လည်သုံးသပ်ပြီး သိမ်းဆည်းရန်

source: Workout Name
my: လေ့ကျင့်မှု အမည်

source: Category
my: အမျိုးအစား

source: Estimated Duration
my: ခန့်မှန်းခြေ ကြာချိန်

source: Difficulty
my: ခက်ခဲမှု အဆင့်

source: Select Exercises
my: လေ့ကျင့်ခန်းများ ရွေးချယ်ရန်

source: Selected Exercises
my: ရွေးချယ်ထားသော လေ့ကျင့်ခန်းများ

source: Rest Time
my: အနားယူချိန်

source: Beginner
my: အစပြုသူ

source: Intermediate
my: အလယ်အလတ်

source: Advanced
my: အဆင့်မြင့်

# chest_muscle
source: Chest
my: ရင်ဘတ်

source: Back
my: ကျောရိုး

source: Shoulders
my: ပခုံး

# arms_muscle
source: Arms
my: လက်မောင်း

source: Legs
my: ခြေထောက်

source: Core
my: ကိုယ်လတ်

source: Glutes
my: တင်ပါးကြွက်သား

source: Cardio
my: နှလုံးသွေးကြော

source: Membership Plans
my: အသင်းဝင်အစီအစဉ်များ

# current_plan
source: CURRENT
my: လက်ရှိ

source: Upgrade
my: အဆင့်မြှင့်ရန်

source: Downgrade
my: အဆင့်လျှော့ရန်

source: Confirm Upgrade
my: အဆင့်မြှင့်မှု အတည်ပြုရန်

source: Pricing Breakdown
my: စျေးနှုန်း အသေးစိတ်

source: Prorated Adjustment
my: အချိန်အလိုက် ချိန်ညှိမှု

source: Total Due Today
my: ယနေ့ စုစုပေါင်း ပေးရမည့်ပမာဏ

source: Next Billing Date
my: နောက်ထပ် ငွေတောင်းခံမည့် ရက်စွဲ

source: Payment Method
my: ငွေပေးချေမှု နည်းလမ်း

source: Change Payment Method
my: ငွေပေးချေမှု နည်းလမ်း ပြောင်းရန်

# agree_to_terms
source: I agree to the terms and conditions
my: စည်းမျဉ်းစည်းကမ်းများကို သဘောတူပါသည်

source: Plan Features
my: အစီအစဉ် အင်္ဂါရပ်များ

source: Enable Notifications
my: အသိပေးချက်များ ဖွင့်ရန်

source: Notification Permission Denied
my: အသိပေးချက် ခွင့်ပြုချက် ငြင်းပယ်ထားသည်

# notification_permission_message
source: Please enable notifications in your device settings to receive workout reminders and updates.
my: လေ့ကျင့်မှု သတိပေးချက်များနှင့် အပ်ဒိတ်များ လက်ခံရရှိရန် သင့်ကိရိယာ ဆက်တင်များတွင် အသိပေးချက်များကို ဖွင့်ပေးပါ။

source: Open Settings
my: ဆက်တင်များ ဖွင့်ရန်

source: Email Support
my: အီးမေးလ် အကူအညီ

source: Phone Support
my: ဖုန်း အကူအညီ

source: Live Chat
my: တိုက်ရိုက် စကားပြောဆိုမှု

source: Active session
my: လက်ရှိလုပ်ဆောင်မှု

source: Show QR code
my: QR ကုဒ် ပြရန်

# workoutPlansAvailable
source: {count} workout plans available
my: {count} လေ့ကျင့်မှု အစီအစဉ် ရရှိနိုင်သည်

source: Quick Workout
my: အမြန် လေ့ကျင့်မှု

# quickWorkoutDescription
source: Start a free-form workout
my: အခမဲ့ပုံစံ လေ့ကျင့်မှု စတင်ပါ

source: Your Workout Plans
my: သင့် လေ့ကျင့်မှု အစီအစဉ်များ

source: View All Workouts
my: လေ့ကျင့်မှုများ အားလုံးကြည့်ရန်

source: Failed to start workout
my: လေ့ကျင့်မှု စတင်ရန် မအောင်မြင်ပါ

source: View All Gyms
my: ဂျင်များ အားလုံးကြည့်ရန်

source: My Profile
my: ကျွန်ုပ်၏ ကိုယ်ရေးအချက်အလက်

source: Membership
my: အသင်းဝင်အခြေအနေ

source: Sign Out
my: ထွက်ရန်

# signOutConfirmation
source: Are you sure you want to sign out?
my: ထွက်လိုသည်မှာ သေချာပါသလား?

# settingsComingSoon
source: Settings screen coming soon
my: ဆက်တင် မကြာမီလာမည်

source: Select Gym
my: ဂျင် ရွေးချယ်ရန်

source: Workout
my: လေ့ကျင့်မှု

# logAtLeastOneSet
source: Log at least one set before finishing
my: အဆုံးသတ်ခြင်းမပြုမီ အနည်းဆုံး တစ်ကြိမ် မှတ်တမ်းတင်ပါ

source: Complete Workout
my: လေ့ကျင့်မှု ပြီးစီးပါပြီ

# completeWorkoutConfirmation
source: You logged {count} sets. Complete this workout?
my: သင်သည် {count} ကြိမ် မှတ်တမ်းတင်ပြီးပါပြီ။ ဤလေ့ကျင့်မှုကို ပြီးစီးမည်လား?

source: Complete
my: ပြီးစီး

# cancelWorkoutConfirmation
source: Are you sure you want to cancel? All progress will be lost.
my: ပယ်ဖျက်လိုသည်မှာ သေချာပါသလား? တိုးတက်မှုအားလုံး ပျောက်သွားပါမည်။

source: Keep Going
my: ဆက်လုပ်မည်

source: Failed to cancel workout
my: လေ့ကျင့်မှု ပယ်ဖျက်မှု မအောင်မြင်ပါ

source: No active workout session
my: လက်ရှိလေ့ကျင့်မှု မရှိပါ

source: Add Set
my: အကြိမ် ထည့်ရန်

source: Select Exercise
my: လေ့ကျင့်ခန်း ရွေးချယ်ရန်

source: Rest Timer
my: အနားယူချိန်တိုင်းကိရိယာ

source: Skip Rest
my: အနားမယူတော့ပါ

source: Book Classes
my: အတန်းများ ကြိုတင်မှာယူရန်

source: Book a Class
my: အတန်း ကြိုတင်မှာယူရန်

source: Book
my: မှာယူမည်

source: Join Waitlist
my: စောင့်ဆိုင်းစာရင်းသို့ ဝင်ရန်

source: Yes, Cancel
my: ဟုတ်ကဲ့၊ ပယ်ဖျက်မည်

# classBookedSuccess
source: Class booked! You'll receive a reminder 30 minutes before.
my: အတန်း ကြိုတင်မှာယူပြီးပါပြီ! အတန်းမတိုင်မီ ၃၀ မိနစ်က သတိပေးချက် ရရှိပါမည်။

# cancelBookingConfirmation
source: Are you sure you want to cancel this booking?
my: ကြိုတင်မှာယူမှုကို ပယ်ဖျက်လိုသည်မှာ သေချာပါသလား?

source: Booking cancelled
my: ကြိုတင်မှာယူမှု ပယ်ဖျက်ပြီးပါပြီ

source: Today
my: ယနေ့

source: Tomorrow
my: မနက်ဖြန်

# monday
source: Mon
my: တနင်္လာ

# tuesday
source: Tue
my: အင်္ဂါ

# wednesday
source: Wed
my: ဗုဒ္ဓဟူး

# thursday
source: Thu
my: ကြာသပတေး

# friday
source: Fri
my: သောကြာ

# saturday
source: Sat
my: စနေ

# sunday
source: Sun
my: တနင်္ဂနွေ

source: All
my: အားလုံး

source: Yoga
my: ယောဂ

source: Spin
my: စပင်

source: Pilates
my: ပိုင်လိတ်

source: FULL
my: ပြည့်ပြီ

source: No upcoming bookings
my: လာမည့် ကြိုတင်မှာယူမှု မရှိပါ

source: No classes scheduled
my: စီစဉ်ထားသော အတန်း မရှိပါ

source: Notification Permission Required
my: အသိပေးချက် ခွင့်ပြုချက် လိုအပ်သည်

# dailyReminderSet
source: Daily reminder set for {time}
my: နေ့စဉ် သတိပေးချက်ကို {time} အတွက် သတ်မှတ်ပြီးပါပြီ

source: Delete Account
my: အကောင့် ဖျက်ရန်

# profileUpdated
source: Profile updated successfully
my: ကိုယ်ရေးအချက်အလက် အပ်ဒိတ်လုပ်ပြီးပါပြီ

source: Change Photo
my: ဓာတ်ပုံ ပြောင်းရန်

source: Uploading...
my: တင်နေသည်...

source: Take Photo
my: ဓာတ်ပုံ ရိုက်ရန်

source: Choose from Gallery
my: ပုံစုမှ ရွေးချယ်ရန်

source: Remove Photo
my: ဓာတ်ပုံ ဖယ်ရှားရန်

# removePhotoConfirmation
source: Are you sure you want to remove your profile photo?
my: သင့်ပရိုဖိုင်ဓာတ်ပုံကို ဖယ်ရှားလိုသည်မှာ သေချာပါသလား?

source: Remove
my: ဖယ်ရှားရန်

source: Camera Permission Required
my: ကင်မရာ ခွင့်ပြုချက် လိုအပ်သည်

source: Photo Library Permission Required
my: ဓာတ်ပုံစု ခွင့်ပြုချက် လိုအပ်သည်

source: Open Settings
my: ဆက်တင်များ ဖွင့်ရန်

source: Set reminder
my: သတိပေးချက် သတ်မှတ်ရန်

source: No workout templates available
my: လေ့ကျင့်မှု နမူနာများ မရှိပါ

# workoutHistoryWillAppearHere
source: Your workout history will appear here
my: သင့် လေ့ကျင့်မှု မှတ်တမ်း ဤနေရာတွင် ပေါ်လာမည်

source: Set Workout Reminder
my: လေ့ကျင့်မှု သတိပေးချက် သတ်မှတ်ရန်

# getRemindedToDo
source: Get reminded to do: {workoutName}
my: လုပ်ရန် သတိပေးရန်: {workoutName}

source: Date
my: ရက်စွဲ

source: Time
my: အချိန်

# reminderSetFor
source: Reminder set for {date} at {time}
my: {date} တွင် {time} အတွက် သတိပေးချက် သတ်မှတ်ပြီးပါပြီ

# todayAt
source: Today at {time}
my: ယနေ့ {time}

# yesterdayAt
source: Yesterday at {time}
my: မနေ့က {time}

source: Track Your Progress
my: သင့် တိုးတက်မှု ခြေရာခံရန်

# signInToTrackProgress
source: Sign in to track your workouts and see your progress over time.
my: သင့် လေ့ကျင့်မှုများကို ခြေရာခံရန်နှင့် အချိန်ကာလအလိုက် တိုးတက်မှုကို ကြည့်ရန် အကောင့်ဝင်ပါ

source: Recent Workouts
my: လတ်တလော လေ့ကျင့်မှုများ

source: Body Metrics
my: ကိုယ်ခန္ဓာ တိုင်းတာမှုများ

source: Log
my: မှတ်တမ်း

source: Hours
my: နာရီ

source: Calories
my: ကယ်လိုရီ

source: Start Your Streak!
my: သင့် အစဉ်ဆက် စတင်ပါ!

# completeWorkoutToBegin
source: Complete a workout today to begin.
my: စတင်ရန် ယနေ့ လေ့ကျင့်မှု တစ်ခု ပြီးမြောက်ပါ

# keepItUpLongestStreak
source: Keep it up! Your longest streak was {count} days.
my: ဆက်ကြိုးစားပါ! သင့် အရှည်ဆုံး အစဉ်ဆက်က {count} ရက်ပါ

# youreBestStreak
source: You're on fire! This is your best streak!
my: အမိုက်စား! ဒါက သင့် အကောင်းဆုံး အစဉ်ဆက်!

# startFirstWorkoutToSeeHere
source: Start your first workout to see it here
my: ဤနေရာတွင် ကြည့်ရန် သင့် ပထမဆုံး လေ့ကျင့်မှု စတင်ပါ

source: Yesterday
my: မနေ့က

# daysAgo
source: {count} days ago
my: {count} ရက်အရင်က

source: Track your body metrics
my: သင့် ကိုယ်ခန္ဓာ တိုင်းတာမှုများ ခြေရာခံရန်

source: Log weight, measurements, and more
my: ကိုယ်အလေးချိန်၊ တိုင်းတာမှုများနှင့် အခြားအရာများကို မှတ်တမ်းတင်ပါ

source: Add First Entry
my: ပထမဆုံး မှတ်တမ်း ထည့်ရန်

source: Mark all read
my: အားလုံး ဖတ်ပြီးအဖြစ် မှတ်သားရန်

source: No Notifications
my: အသိပေးချက် မရှိပါ

source: You're all caught up!
my: သင် အလုံးစုံ အဆင်ပြေနေပါပြီ!

# noWorkoutsYetTitle
source: No Workouts Yet
my: လေ့ကျင့်မှု မရှိသေးပါ

# startFitnessJourney
source: Start your fitness journey by logging your first workout.
my: သင့် ကျန်းမာရေး ခရီးကို သင့် ပထမဆုံး လေ့ကျင့်မှုဖြင့် စတင်ပါ

source: No Classes Available
my: အတန်းများ မရှိပါ

# checkBackLater
source: Check back later for upcoming classes.
my: လာမည့် အတန်းများအတွက် နောက်မှ ပြန်စစ်ပါ

source: Refresh
my: ပြန်စစ်ရန်

source: No Bookings
my: ကြိုတင်မှာယူမှု မရှိပါ

# noBookingsYet
source: You haven't booked any classes yet.
my: သင် အတန်းများကို မှာယူခဲ့ခြင်း မရှိသေးပါ

source: Browse Classes
my: အတန်းများ ရှာကြည့်ရန်

source: No Exercises Found
my: လေ့ကျင့်ခန်းများ မတွေ့ပါ

# tryAdjustingFilters
source: Try adjusting your search or filters.
my: သင့် ရှာဖွေမှု သို့မဟုတ် စစ်ထုတ်မှုများကို ပြောင်းကြည့်ပါ

source: Clear Filters
my: စစ်ထုတ်မှုများ ရှင်းလင်းရန်

source: No Results Found
my: ရလဒ် မတွေ့ပါ

# tryDifferentKeywords
source: Try different keywords or filters.
my: မတူညီသော စကားလုံး သို့မဟုတ် စစ်ထုတ်မှုများကို စမ်းကြည့်ပါ

source: Clear Search
my: ရှာဖွေမှု ရှင်းလင်းရန်
